In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500,
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])
df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [3]:
sales_average = ((df['retail_price'] - df['wholesale_price']) * df['sales']).mean()
sales_average

np.float64(22140.0)

In [4]:
(df['retail_price'] - df['wholesale_price']) * df['sales']

0    50000.0
1    40000.0
2    20000.0
3      100.0
4      600.0
dtype: float64

In [5]:
df.loc[(df['retail_price'] - df['wholesale_price']) * df['sales'] > sales_average, ['product_id','name']]

   product_id            name
0          23        computer
1          96  Python Workout

### Beyond the exercise

Show the ID and name of products whose net income `is in the top 25% quantile.`

In [6]:
net_incomes = (df['retail_price'] - df['wholesale_price']) 
net_incomes

0    500.0
1     40.0
2     40.0
3      0.5
4      2.0
dtype: float64

In [7]:
quantile_25 = net_incomes.quantile(0.75)
quantile_25

np.float64(40.0)

In [8]:
net_incomes.describe()

count      5.000000
mean     116.500000
std      215.257404
min        0.500000
25%        2.000000
50%       40.000000
75%       40.000000
max      500.000000
dtype: float64

In [9]:
df.loc[net_incomes > quantile_25, ['product_id', 'name']]

   product_id      name
0          23  computer

Show the ID and name of products with lower-than-average sales numbers and whose wholesale price is greater than the average.

In [10]:
df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [11]:
df.loc[df['sales'] < df['sales'].mean()]

   product_id      name  wholesale_price  retail_price  sales
0          23  computer            500.0          1000    100
3          15    banana              0.5             1    200
4          87  sandwich              3.0             5    300

In [21]:
df.loc[(df['sales'] < df['sales'].mean()) & (df['wholesale_price'] > df['wholesale_price'].mean()), ['product_id', 'name']]

   product_id      name
0          23  computer

In [18]:
df['sales'] < df['sales'].mean()

0     True
1    False
2    False
3     True
4     True
Name: sales, dtype: bool

In [16]:
df['wholesale_price'] > df['wholesale_price'].mean()

0     True
1    False
2    False
3    False
4    False
Name: wholesale_price, dtype: bool

Show the name and wholesale and retail prices of products with IDs between 80 and 100 and that sold fewer than 400 units.

In [22]:
df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [29]:
df.loc[(df['product_id'] >= 80) & (df['product_id'] <= 100) & (df['sales'] < 400), ['name','wholesale_price', 'retail_price']]

       name  wholesale_price  retail_price
4  sandwich              3.0             5

In [31]:
print(df['product_id'] >= 80, df['product_id'] <= 100, df['sales'] < 400)

0    False
1     True
2     True
3    False
4     True
Name: product_id, dtype: bool 0    True
1    True
2    True
3    True
4    True
Name: product_id, dtype: bool 0     True
1    False
2    False
3     True
4     True
Name: sales, dtype: bool